# ConstraintsNotSatisfied Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures..::..ConstraintsNotSatisfied Property
BuiltInFailures..::..ArrayFailures Class See Also
---
Constraints are not satisfied
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConstraintsNotSatisfied { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstraintsNotSatisfied As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConstraintsNotSatisfied {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ArrayFailures Class
Autodesk.Revit.DB Namespace